def number_to_words(n):
    tenths = {
        10: "десять",
        11: "одиннадцать",
        12: "двенадцать",
        13: "тринадцать",
        14: "четырнадцать",
        15: "пятнадцать",
        16: "шестнадцать",
        17: "семнадцать",
        18: "восемнадцать",
        19: "девятнадцать",
    }
    ones = {
        1: "один",
        2: "два",
        3: "три",
        4: "четыре",
        5: "пять",
        6: "шесть",
        7: "семь",
        8: "восемь",
        9: "девять",
    }

    tens = {
        2: "двадцать",
        3: "тридцать",
        4: "сорок",
        5: "пятьдесят",
        6: "шестьдесят",
        7: "семьдесят",
        8: "восемьдесят",
        9: "девяносто",
    }

    if 10 <= n <= 19:
        return tenths[n]
    elif 20 <= n <= 99:
        ten = n // 10
        one = n % 10
        if one == 0:
            return tens[ten]
        else:
            return tens[ten] + " " + ones[one]
    elif 1 <= n <= 9:
        return ones[n]


print(number_to_words(15))
print(number_to_words(23))
print(number_to_words(40))
print(number_to_words(7))
